In [2]:
%load_ext sql

In [3]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [4]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 4, 0, 50, 3, 796000), 99, 'free', None, None, '124', 'Salt Lake City, UT', 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (2, datetime.datetime(2018, 11, 4, 2, 54, 52, 796000), 43, 'free', None, None, '42', 'San Antonio-New Braunfels, TX', '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 4, 2, 58, 57, 796000), 43, 'free', None, None, '42', 'San Antonio-New Braunfels, TX', '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 4, 3, 2, 20, 796000), 43, 'free', None, None, '42', 'San Antonio-New Braunfels, TX', '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 4, 4, 35, 52, 796000), 6, 'free', None, None, '225', 'Atlanta-Sandy Springs-Roswell, GA', 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:32.0) Gecko/20100101 Firefox/32.0')]

In [5]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(99, 'Ann', 'Banks', 'F', 'free'),
 (43, 'Jahiem', 'Miles', 'M', 'free'),
 (6, 'Cecilia', 'Owens', 'F', 'free'),
 (25, 'Jayden', 'Graves', 'M', 'paid'),
 (51, 'Maia', 'Burke', 'F', 'free')]

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOXILUQ12A58A7C72A', 'Jenny Take a Ride', 'ARP6N5A1187B99D1A3', 2004, 207.43791),
 ('SOTCKKY12AB018A141', 'Sonnerie lalaleulé hi houuu', 'ARGSAFR1269FB35070', 0, 29.54404),
 ('SOBCOSW12A8C13D398', 'Rumba De Barcelona', 'AR7SMBG1187B9B9066', 0, 218.38322),
 ('SOLEYHO12AB0188A85', 'Got My Mojo Workin', 'ARAGB2O1187FB3A161', 0, 338.23302),
 ('SOGVQGJ12AB017F169', 'Ten Tonne', 'AR62SOJ1187FB47BB5', 2005, 337.68444)]

In [7]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARP6N5A1187B99D1A3', 'Mitch Ryder', 'Hamtramck, MI', nan, nan),
 ('ARGSAFR1269FB35070', 'Blingtones', '', nan, nan),
 ('AR7SMBG1187B9B9066', 'Los Manolos', '', nan, nan),
 ('ARAGB2O1187FB3A161', 'Pucho & His Latin Soul Brothers', '', nan, nan),
 ('AR62SOJ1187FB47BB5', 'Chase & Status', '', nan, nan)]

In [8]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 4, 0, 50, 3, 796000), 0, 4, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 4, 2, 54, 52, 796000), 2, 4, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 4, 2, 58, 57, 796000), 2, 4, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 4, 3, 2, 20, 796000), 3, 4, 44, 11, 2018, 6),
 (datetime.datetime(2018, 11, 4, 4, 35, 52, 796000), 4, 4, 44, 11, 2018, 6)]

## Analytical queries of interest

#### Sparkify team is interested to the distribution of users based on the gender using the application.

In [13]:
%sql SELECT users.gender, COUNT(*) as counts FROM users GROUP BY users.gender;

 * postgresql://student:***@127.0.0.1/sparkifydb
2 rows affected.

[('M', 41), ('F', 55)]

#### Sparkify team is interested to know on how many paid users are using the application based on the location ordered in the descending order.

In [20]:
%sql SELECT songplays.location, COUNT(songplays.level) as counts FROM songplays WHERE songplays.level = 'paid' GROUP BY songplays.location ORDER BY counts DESC;

 * postgresql://student:***@127.0.0.1/sparkifydb
20 rows affected.

[('San Francisco-Oakland-Hayward, CA', 650),
 ('Portland-South Portland, ME', 648),
 ('Lansing-East Lansing, MI', 557),
 ('Chicago-Naperville-Elgin, IL-IN-WI', 462),
 ('Atlanta-Sandy Springs-Roswell, GA', 428),
 ('Waterloo-Cedar Falls, IA', 397),
 ('Lake Havasu City-Kingman, AZ', 321),
 ('Tampa-St. Petersburg-Clearwater, FL', 289),
 ('Sacramento--Roseville--Arden-Arcade, CA', 241),
 ('Janesville-Beloit, WI', 241),
 ('Winston-Salem, NC', 213),
 ('Birmingham-Hoover, AL', 208),
 ('San Jose-Sunnyvale-Santa Clara, CA', 178),
 ('Red Bluff, CA', 178),
 ('Marinette, WI-MI', 169),
 ('New York-Newark-Jersey City, NY-NJ-PA', 149),
 ('Augusta-Richmond County, GA-SC', 140),
 ('Detroit-Warren-Dearborn, MI', 72),
 ('San Antonio-New Braunfels, TX', 33),
 ('Longview, TX', 17)]

#### The sparkify team is interested to understand which devices mostly make use of their application. Thus helping them in marketting better.

In [29]:
%sql SELECT 'Windows' as os, COUNT(*) FROM songplays WHERE songplays.user_agent LIKE '%Windows%' UNION SELECT 'Mac' as os, COUNT(*) FROM songplays WHERE songplays.user_agent LIKE '%Mac%' UNION SELECT 'Linux' as os, COUNT(*) FROM songplays WHERE songplays.user_agent LIKE '%Linux%';

 * postgresql://student:***@127.0.0.1/sparkifydb
3 rows affected.

[('Linux', 1153), ('Mac', 3239), ('Windows', 2428)]

In [49]:
%sql SELECT count(*) as midnight_listeners FROM songplays JOIN time ON songplays.start_time = time.start_time where time.hour >= 0 and time.hour <= 4;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(671,)]

In [50]:
%sql SELECT count(*) office_time_listeners FROM songplays JOIN time ON songplays.start_time = time.start_time where time.hour >= 7 and time.hour <= 20;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[(5106,)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).